---
kind: type
id: T:Autodesk.Revit.DB.CompoundStructureError
source: html/8e8457e0-84c4-ccb1-114c-fa25a6d37fed.htm
---
# Autodesk.Revit.DB.CompoundStructureError

When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.

## Syntax (C#)
```csharp
public enum CompoundStructureError
```

## Remarks
'LayerTooThin' enum value was removed in 2016